; domain
;; Transport sequential
;;

(define (domain transport)
  (:requirements :typing :action-costs)
  (:types
        location target locatable - object
        vehicle package - locatable
        capacity-number - object
  )

  (:predicates 
     (road ?l1 ?l2 - location)
     (at ?x - locatable ?v - location)
     (in ?x - package ?v - vehicle)
     (capacity ?v - vehicle ?s1 - capacity-number)
     (capacity-predecessor ?s1 ?s2 - capacity-number)
  )

  (:functions
     (road-length ?l1 ?l2 - location) - number
     (total-cost) - number
  )

  (:action drive
    :parameters (?v - vehicle ?l1 ?l2 - location)
    :precondition (and
        (at ?v ?l1)
        (road ?l1 ?l2)
      )
    :effect (and
        (not (at ?v ?l1))
        (at ?v ?l2)
        (increase (total-cost) (road-length ?l1 ?l2))
      )
  )

 (:action pick-up
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (at ?p ?l)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s2)
      )
    :effect (and
        (not (at ?p ?l))
        (in ?p ?v)
        (capacity ?v ?s1)
        (not (capacity ?v ?s2))
        (increase (total-cost) 1)
      )
  )

  (:action drop
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (in ?p ?v)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s1)
      )
    :effect (and
        (not (in ?p ?v))
        (at ?p ?l)
        (capacity ?v ?s2)
        (not (capacity ?v ?s1))
        (increase (total-cost) 1)
      )
  )

)

; problem
; Transport three-cities-sequential-4nodes-1000size-4degree-100mindistance-2trucks-4packages-259seed

(define (problem transport-three-cities-sequential-4nodes-1000size-4degree-100mindistance-2trucks-4packages-259seed)
 (:domain transport)
 (:objects
  city-1-loc-1 - location
  city-2-loc-1 - location
  city-3-loc-1 - location
  city-1-loc-2 - location
  city-2-loc-2 - location
  city-3-loc-2 - location
  city-1-loc-3 - location
  city-2-loc-3 - location
  city-3-loc-3 - location
  city-1-loc-4 - location
  city-2-loc-4 - location
  city-3-loc-4 - location
  truck-1 - vehicle
  truck-2 - vehicle
  package-1 - package
  package-2 - package
  package-3 - package
  package-4 - package
  capacity-0 - capacity-number
  capacity-1 - capacity-number
  capacity-2 - capacity-number
  capacity-3 - capacity-number
  capacity-4 - capacity-number
 )
 (:init
  (= (total-cost) 0)
  (capacity-predecessor capacity-0 capacity-1)
  (capacity-predecessor capacity-1 capacity-2)
  (capacity-predecessor capacity-2 capacity-3)
  (capacity-predecessor capacity-3 capacity-4)
  ; 445,610 -> 40,823
  (road city-1-loc-3 city-1-loc-1)
  (= (road-length city-1-loc-3 city-1-loc-1) 46)
  ; 40,823 -> 445,610
  (road city-1-loc-1 city-1-loc-3)
  (= (road-length city-1-loc-1 city-1-loc-3) 46)
  ; 445,610 -> 562,92
  (road city-1-loc-3 city-1-loc-2)
  (= (road-length city-1-loc-3 city-1-loc-2) 54)
  ; 562,92 -> 445,610
  (road city-1-loc-2 city-1-loc-3)
  (= (road-length city-1-loc-2 city-1-loc-3) 54)
  ; 938,505 -> 562,92
  (road city-1-loc-4 city-1-loc-2)
  (= (road-length city-1-loc-4 city-1-loc-2) 56)
  ; 562,92 -> 938,505
  (road city-1-loc-2 city-1-loc-4)
  (= (road-length city-1-loc-2 city-1-loc-4) 56)
  ; 938,505 -> 445,610
  (road city-1-loc-4 city-1-loc-3)
  (= (road-length city-1-loc-4 city-1-loc-3) 51)
  ; 445,610 -> 938,505
  (road city-1-loc-3 city-1-loc-4)
  (= (road-length city-1-loc-3 city-1-loc-4) 51)
  ; 2794,84 -> 2528,373
  (road city-2-loc-2 city-2-loc-1)
  (= (road-length city-2-loc-2 city-2-loc-1) 40)
  ; 2528,373 -> 2794,84
  (road city-2-loc-1 city-2-loc-2)
  (= (road-length city-2-loc-1 city-2-loc-2) 40)
  ; 2916,202 -> 2528,373
  (road city-2-loc-3 city-2-loc-1)
  (= (road-length city-2-loc-3 city-2-loc-1) 43)
  ; 2528,373 -> 2916,202
  (road city-2-loc-1 city-2-loc-3)
  (= (road-length city-2-loc-1 city-2-loc-3) 43)
  ; 2916,202 -> 2794,84
  (road city-2-loc-3 city-2-loc-2)
  (= (road-length city-2-loc-3 city-2-loc-2) 17)
  ; 2794,84 -> 2916,202
  (road city-2-loc-2 city-2-loc-3)
  (= (road-length city-2-loc-2 city-2-loc-3) 17)
  ; 2582,281 -> 2528,373
  (road city-2-loc-4 city-2-loc-1)
  (= (road-length city-2-loc-4 city-2-loc-1) 11)
  ; 2528,373 -> 2582,281
  (road city-2-loc-1 city-2-loc-4)
  (= (road-length city-2-loc-1 city-2-loc-4) 11)
  ; 2582,281 -> 2794,84
  (road city-2-loc-4 city-2-loc-2)
  (= (road-length city-2-loc-4 city-2-loc-2) 29)
  ; 2794,84 -> 2582,281
  (road city-2-loc-2 city-2-loc-4)
  (= (road-length city-2-loc-2 city-2-loc-4) 29)
  ; 2582,281 -> 2916,202
  (road city-2-loc-4 city-2-loc-3)
  (= (road-length city-2-loc-4 city-2-loc-3) 35)
  ; 2916,202 -> 2582,281
  (road city-2-loc-3 city-2-loc-4)
  (= (road-length city-2-loc-3 city-2-loc-4) 35)
  ; 1138,2176 -> 1810,2143
  (road city-3-loc-2 city-3-loc-1)
  (= (road-length city-3-loc-2 city-3-loc-1) 68)
  ; 1810,2143 -> 1138,2176
  (road city-3-loc-1 city-3-loc-2)
  (= (road-length city-3-loc-1 city-3-loc-2) 68)
  ; 1098,2482 -> 1138,2176
  (road city-3-loc-3 city-3-loc-2)
  (= (road-length city-3-loc-3 city-3-loc-2) 31)
  ; 1138,2176 -> 1098,2482
  (road city-3-loc-2 city-3-loc-3)
  (= (road-length city-3-loc-2 city-3-loc-3) 31)
  ; 1941,2594 -> 1810,2143
  (road city-3-loc-4 city-3-loc-1)
  (= (road-length city-3-loc-4 city-3-loc-1) 47)
  ; 1810,2143 -> 1941,2594
  (road city-3-loc-1 city-3-loc-4)
  (= (road-length city-3-loc-1 city-3-loc-4) 47)
  ; 938,505 <-> 2528,373
  (road city-1-loc-4 city-2-loc-1)
  (= (road-length city-1-loc-4 city-2-loc-1) 160)
  (road city-2-loc-1 city-1-loc-4)
  (= (road-length city-2-loc-1 city-1-loc-4) 160)
  (road city-1-loc-4 city-3-loc-1)
  (= (road-length city-1-loc-4 city-3-loc-1) 160)
  (road city-3-loc-1 city-1-loc-4)
  (= (road-length city-3-loc-1 city-1-loc-4) 160)
  (road city-2-loc-2 city-3-loc-1)
  (= (road-length city-2-loc-2 city-3-loc-1) 199)
  (road city-3-loc-1 city-2-loc-2)
  (= (road-length city-3-loc-1 city-2-loc-2) 199)
  (at package-1 city-3-loc-2)
  (at package-2 city-2-loc-1)
  (at package-3 city-2-loc-2)
  (at package-4 city-2-loc-1)
  (at truck-1 city-2-loc-2)
  (capacity truck-1 capacity-3)
  (at truck-2 city-3-loc-1)
  (capacity truck-2 capacity-2)
 )
 (:goal (and
  (at package-1 city-1-loc-2)
  (at package-2 city-3-loc-4)
  (at package-3 city-3-loc-1)
  (at package-4 city-3-loc-3)
 ))
 (:metric minimize (total-cost))
)

; plan
1. (drive truck-2 city-3-loc-1 city-3-loc-2)
   deleted: (at truck-2 city-3-loc-1)
   added: (at truck-2 city-3-loc-2)
   goals met: 0 of 4
2. (pick-up truck-2 city-3-loc-2 package-1 capacity-1 capacity-2)
   deleted: (at package-1 city-3-loc-2) (capacity truck-2 capacity-2)
   added: (in package-1 truck-2) (capacity truck-2 capacity-1)
   goals met: 0 of 4
3. (pick-up truck-1 city-2-loc-2 package-3 capacity-2 capacity-3)
   deleted: (at package-3 city-2-loc-2) (capacity truck-1 capacity-3)
   added: (in package-3 truck-1) (capacity truck-1 capacity-2)
   goals met: 0 of 4
4. (drive truck-1 city-2-loc-2 city-2-loc-1)
   deleted: (at truck-1 city-2-loc-2)
   added: (at truck-1 city-2-loc-1)
   goals met: 0 of 4
5. (pick-up truck-1 city-2-loc-1 package-4 capacity-1 capacity-2)
   deleted: (at package-4 city-2-loc-1) (capacity truck-1 capacity-2)
   added: (in package-4 truck-1) (capacity truck-1 capacity-1)
   goals met: 0 of 4
6. (pick-up truck-1 city-2-loc-1 package-2 capacity-0 capacity-1)
   deleted: (at package-2 city-2-loc-1) (capacity truck-1 capacity-1)
   added: (in package-2 truck-1) (capacity truck-1 capacity-0)
   goals met: 0 of 4
7. (drive truck-2 city-3-loc-2 city-3-loc-1)
   deleted: (at truck-2 city-3-loc-2)
   added: (at truck-2 city-3-loc-1)
   goals met: 0 of 4
8. (drive truck-2 city-3-loc-1 city-1-loc-4)
   deleted: (at truck-2 city-3-loc-1)
   added: (at truck-2 city-1-loc-4)
   goals met: 0 of 4
9. (drive truck-2 city-1-loc-4 city-1-loc-2)
   deleted: (at truck-2 city-1-loc-4)
   added: (at truck-2 city-1-loc-2)
   goals met: 0 of 4
10. (drive truck-1 city-2-loc-1 city-1-loc-4)
   deleted: (at truck-1 city-2-loc-1)
   added: (at truck-1 city-1-loc-4)
   goals met: 0 of 4
11. (drive truck-1 city-1-loc-4 city-3-loc-1)
   deleted: (at truck-1 city-1-loc-4)
   added: (at truck-1 city-3-loc-1)
   goals met: 0 of 4
12. (drive truck-1 city-3-loc-1 city-3-loc-4)
   deleted: (at truck-1 city-3-loc-1)
   added: (at truck-1 city-3-loc-4)
   goals met: 0 of 4
13. (drop truck-1 city-3-loc-4 package-2 capacity-0 capacity-1)
   deleted: (in package-2 truck-1) (capacity truck-1 capacity-0)
   added: (at package-2 city-3-loc-4) (capacity truck-1 capacity-1)
   goals met: 1 of 4
14. (drive truck-1 city-3-loc-4 city-3-loc-1)
   deleted: (at truck-1 city-3-loc-4)
   added: (at truck-1 city-3-loc-1)
   goals met: 1 of 4
15. (drop truck-1 city-3-loc-1 package-3 capacity-1 capacity-2)
   deleted: (in package-3 truck-1) (capacity truck-1 capacity-1)
   added: (at package-3 city-3-loc-1) (capacity truck-1 capacity-2)
   goals met: 2 of 4
16. (drive truck-1 city-3-loc-1 city-3-loc-2)
   deleted: (at truck-1 city-3-loc-1)
   added: (at truck-1 city-3-loc-2)
   goals met: 2 of 4
17. (drive truck-1 city-3-loc-2 city-3-loc-3)
   deleted: (at truck-1 city-3-loc-2)
   added: (at truck-1 city-3-loc-3)
   goals met: 2 of 4
18. (drop truck-1 city-3-loc-3 package-4 capacity-2 capacity-3)
   deleted: (in package-4 truck-1) (capacity truck-1 capacity-2)
   added: (at package-4 city-3-loc-3) (capacity truck-1 capacity-3)
   goals met: 3 of 4
19. (drop truck-2 city-1-loc-2 package-1 capacity-1 capacity-2)
   deleted: (in package-1 truck-2) (capacity truck-2 capacity-1)
   added: (at package-1 city-1-loc-2) (capacity truck-2 capacity-2)
   goals met: 4 of 4
